{
  "menu": {
    "cv": "Resume",
    "Portfolio": "Portfolio",
    "Contact": "Contact",
    "about": "About me"
  },
  "others": {
    "years": "years",
    "modalThemeLight": "I'm working on a lighter theme, meanwhile, let's keep the lights off"
  },
  "homeBanner": {
    "title": "Frontend Web Developer",
    "description": "I am working on my new portfolio and I will be back with brand new styles very soon!"
  },
  "cv": {
    "title": "Resume",
    "education": "Education",
    "highschool": "Highschool",
    "workExperienceTitle": "Work experience",
    "workExperience": {
      "title1": "Frontend Software Developer",
      "desc1": "Developed and maintained user-friendly and responsive web applications using React.js, Typescript and Vanilla Js. Collaborated closely with designers and backend developers to implement seamless user experiences.",
      "title2": "Frontend Software Developer",
      "desc2": "Hired for a limited duration for the migration from jQuery to React for an entire E-commerce App. Ensuring project completion with enhanced efficiency and sustainability.",
      "title3": "Web designer",
      "desc3": "Designed and developed websites and e-commerce sites using WordPress and PrestaShop. Ensured cross-browser compatibility and responsiveness in site designs. Collaborated with clients to gather requirements and provide solutions for their online presence needs."
    },
    "skills": {
      "title": "Skills",
      "subtitle1": {
        "title": "Technical skills",
        "test": "Unit Testing with Jest",
        "responsive": "Responsive Web Design",
        "git": "Version Control with Git"
      },
      "subtitle2": {
        "title": "Soft Skills",
        "skill1": "Teamwork",
        "skill2": "Adaptability",
        "skill3": "Communication",
        "skill4": "Problem Solving"
      }
    },
    "degrees": {
      "title": "Degrees & Certificates",
      "subtitle1": "International English Language Testing System (2012) ",
      "subtitle2": "Fullstack Mern bootcamp (480 hours)",
      "subtitle3": "Using TypeScript with React by Dmytro Danylov",
      "subtitle4": "The Ultimate React Course 2023: React, Redux & More by Jonas Schmedtmann (160 hours)"
    },
    "languages": {
      "title": "Languages",
      "lang1": "Spanish (Native)",
      "lang2": "English (Fluent)",
      "lang3": "Galician (Native)"
    },
    "about": {
      "title": "More about me",
      "desc1": "Thirst for knowledge, always looking forward to work with people and sort out any kind of problems. Def, I consider myself a team player. Always down for Volunteering and helping all beings."
    }
  },
  "portfolio": {
    "title": "Portfolio",
    "desc": "More projects coming soon...",
    "buttons": {
      "live": "Live view",
      "code": "code",
      "info": "More info",
      "close": "Close"
    },
    "projects": {
      "balloon": {
        "description": "It is an e-commerce web application developed with cutting-edge technologies. This platform, built with React.js for the frontend and Node.js with Express.js for the backend, represents a milestone in my career as a developer.\n\nThe application offers users the opportunity to book unique experiences throughout the peninsula. Our primary focus was to provide a seamless and personalized booking experience. We implemented a wide range of features, from a ticket reservation system to an advanced filter that allows users to search for activities by category, city, price range, and available dates.\n\nTo enhance the user experience, we integrated libraries such as React Date Picker to simplify date selection and React Responsive Carousel to present images and activity details attractively.\n\nThis project was an exciting challenge that allowed us to showcase our web development skills and create an application that simplifies the search and booking of experiences."
      },
      "fitness": {
        "description": ""
      }
    }
  },
  "contact": {
    "title": "Contact me",
    "desc": "Fill the form below and I will get back to you as soon as possible.",
    "form": {
      "name": "Your name",
      "phone": "Your phone num",
      "mail": "Your email",
      "message": "Write your message",
      "privacy": "I have read and accept the privacy policy",
      "send": "Send"
    }
  },
  "about": {
    "title": "About me",
    "desc": "I embarked on this journey in 2011 when I immersed myself in the world of website development, crafting an E-commerce site for my company using Prestashop. During this time, I delved into the realms of HTML, CSS, and the fundamentals of JavaScript to make my websites more intelligent and efficient.\n After making the decision to close my company, I redirected my focus towards my passion, offering website development services to those in need.\n I also started building websites for everyone else who needed them after shutting down my company so I could focus full time on my passion.\n In 2021, I enrolled in a comprehensive JavaScript course covering both front-end and back-end development with React, Express JS, GIT, and SQL. It was during this course that I developed a deep appreciation for the React library and its rich ecosystem, ultimately deciding to specialize in it and hone my skills further.\n With an insatiable thirst for knowledge and a strong desire to collaborate with others to solve diverse challenges, I identify myself as a dedicated team player. I am always eager to volunteer and extend a helping hand to all living beings."
  }
}
