{
  "menu": {
    "cv": "Resume",
    "Portfolio": "Portfolio",
    "Contact": "Contact",
    "about": "About me"
  },
  "others": {
    "years": "years",
    "modalThemeLight": "I'm working on a lighter theme, meanwhile, let's keep the lights off"
  },
  "homeBanner": {
    "title": "Frontend Software Developer",
    "description": "I am working on my new portfolio and I will be back with brand new styles very soon!"
  },
  "cv": {
    "title": "Resume",
    "education": "Education",
    "highschool": "Highschool",
    "university": "University (+25)",
    "workExperienceTitle": "Work experience",
    "workExperience": {
      "title1": "Frontend Software Developer",
      "desc1": "Achievements: Collaborated with senior developers to refactor and optimize codebase, resulting in a notable reduction in page load times and improved overall user experience.",
      "desc1-2": "Implemented responsive design features and accessibility improvements, leading to a big increase in mobile user engagement and positive user feedback on usability.",
      "title2": "Frontend Software Developer",
      "desc2": "Achievements: Worked closely with the development team to migrate UI components from jQuery to React, contributing to a modernized codebase and enhanced maintainability.",
      "desc2-2": "Assisted in the integration of RESTful APIs into frontend components, improving data fetching processes and contributing to a more seamless user experience.",

      "title3": "Web designer",
      "desc3": "Achievements: Designed and implemented responsive website layouts using HTML5, CSS3 (including Sass), and Bootstrap, ensuring cross-browser compatibility and mobile responsiveness.",

      "desc3-2": "Collaborated with clients to understand their design preferences and requirements, delivering visually appealing and functional websites that met their needs and received positive feedback."
    },
    "skills": {
      "title": "Skills",
      "subtitle1": {
        "title": "Technical skills",
        "test": "Unit Testing with Jest",
        "responsive": "Responsive Web Design",
        "git": "Version Control with Git"
      },
      "subtitle2": {
        "title": "Soft Skills",
        "skill1": "Teamwork",
        "skill2": "Adaptability",
        "skill3": "Communication",
        "skill4": "Problem Solving"
      }
    },
    "degrees": {
      "title": "Degrees & Certificates",
      "subtitle1": "International English Language Testing System (2012) ",
      "subtitle2": "Fullstack BootCamp width NodeJs and Express (480 hours)",
      "subtitle3": "Using TypeScript with React by Dmytro Danylov",
      "subtitle4": "The Ultimate React Course 2023: React, Redux & More by Jonas Schmedtmann (160 hours)"
    },
    "languages": {
      "title": "Languages",
      "lang1": "Spanish (Native)",
      "lang2": "English (Fluent)",
      "lang3": "Galician (Native)"
    },
    "about": {
      "title": "More about me",
      "desc1": "Thirst for knowledge, always looking forward to work with people and sort out any kind of problems. Def, I consider myself a team player. Always down for Volunteering and helping all beings."
    }
  },
  "portfolio": {
    "title": "Portfolio",
    "desc": "More projects coming soon...",
    "buttons": {
      "live": "Live view",
      "code": "code",
      "info": "More info",
      "close": "Close"
    },
    "projects": {
      "balloon": {
        "description": "It is an e-commerce web application developed with cutting-edge technologies. This platform, built with React.js for the frontend and Node.js with Express.js for the backend, represents a milestone in my career as a developer.\n\nThe application offers users the opportunity to book unique experiences throughout the peninsula. Our primary focus was to provide a seamless and personalized booking experience. We implemented a wide range of features, from a ticket reservation system to an advanced filter that allows users to search for activities by category, city, price range, and available dates.\n\nTo enhance the user experience, we integrated libraries such as React Date Picker to simplify date selection and React Responsive Carousel to present images and activity details attractively.\n\nThis project was an exciting challenge that allowed us to showcase our web development skills and create an application that simplifies the search and booking of experiences.",
        "status": ""
      },
      "fitness": {
        "description": "Feel-Fit is primarily a front-end application developed using React.js 18, TypeScript, and Tailwind CSS for styling. This innovative app streamlines the process of gathering user information through four simple steps and generates a personalized weekly plan for exercise and meal preparation. Leveraging cutting-edge OpenAI technology, Feel-Fit empowers users to effectively manage their time and achieve their fitness goals. Currently in the development phase, Feel-Fit is an open-source project, inviting collaboration and contributions from the developer community.",
        "status": ""
      },
      "elefantes": {
        "description": "Customized Genesis Framework: Utilizing the Genesis framework allowed for the creation of a bespoke and lightweight design without themes or page builders, optimizing performance and ensuring a seamless user experience across various devices.\n\nUnique Design Elements: Designed captivating hero sections showcasing memorable travel moments and crafted navigation menus that guide users through enchanting destinations, reflecting the adventurous spirit of the family's journeys.\n\nInteractive Maps and Location Insights: Implemented interactive maps highlighting the family's global travels, accompanied by travel tips and location-based anecdotes to engage and inspire visitors.\n\nDynamic Custom Fields: Integrated dynamic custom fields using PHP to facilitate content management, enabling the family bloggers to effortlessly curate and share their immersive travel stories.\n\nWordPress REST API Integration: Leveraged the WordPress REST API to enhance the blog's functionality, enabling real-time updates, improved search capabilities, and efficient data retrieval for an enriched user experience.\n\nPerformance Optimization: Optimized website performance to ensure fast loading times, seamless navigation, and impeccable responsiveness, providing a delightful browsing experience for visitors worldwide.\n\nEngaging Multimedia Experiences: Created captivating travel narratives with stunning visuals, immersive galleries, and compelling videos, transporting visitors to unique destinations and memorable adventures.",
        "status": "none"
      }
    }
  },
  "contact": {
    "title": "Contact me",
    "desc": "Fill the form below and I will get back to you as soon as possible.",
    "form": {
      "name": "Your name",
      "phone": "Your phone num",
      "mail": "Your email",
      "message": "Write your message",
      "privacy": "I have read and accept the privacy policy",
      "send": "Send"
    }
  },
  "about": {
    "title": "About me",
    "desc": "As a Freelance Web Developer, I build and maintain E-commerce apps and websites for various clients, using React and other technologies.\n\n I have over 13 years of experience in web development, starting from my own company in 2011, where I used Prestashop to create online stores.I specialize in React and its ecosystem, having completed a JS course in 2021 that covered both front-end and back-end with React, Express JS, and GIT SQL. I also have skills in TypeScript, Hexagonal architecture, Webpack, jQuery, HTML, CSS, and basic JS. \n\nI have worked with clients such as Ferrovial, Acciona, Chilean Army, and Ebro Hydrographic Confederation, delivering high-quality and functional products with React.js and TypeScript.I am passionate about learning new technologies and improving my skills.\n\n I enjoy collaborating with others to solve problems and deliver solutions. I am a team player, always willing to help and volunteer. My goal is to create user-friendly and sustainable web applications that meet the needs and expectations of my clients."
  }
}
